MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC1345FHN33/mcu.h

/****************************************************************************************************//**
 * @file     LPC13Uxx.h
 *
 * 
 *
 * @brief    CMSIS Cortex-M3 Core Peripheral Access Layer Header File for
 *           default LPC13Uxx Device Series
 *
 * @version  V0.1
 * @date     18. Jan 2012
 *
 * @note     Generated with SFDGen V2.6 Build 4f  on Tuesday, 17.01.2012 13:39:52
 *
 *           from CMSIS SVD File 'LPC13uxx_svd_v0.1.xml' Version 0.1,
 *           created on Thurs, 01.19.2012 15:13:15, last modified on Thurs, 01.19.2012 15:53:09
 *
 *                                                                                      modified by KEIL
 *******************************************************************************************************/

/** @addtogroup NXP
  * @{
  */

/** @addtogroup LPC13Uxx
  * @{
  */

#ifndef __LPC13UXX_H__
#define __LPC13UXX_H__

#ifdef __cplusplus
extern "C" {
#endif 


#if defined ( __CC_ARM   )
  #pragma anon_unions
#endif

 /* Interrupt Number Definition */

typedef enum {
// -------------------------  Cortex-M3 Processor Exceptions Numbers  -----------------------------
  Reset_IRQn                        = -15,  /*!<   1  Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn               = -14,  /*!<   2  Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn                    = -13,  /*!<   3  Hard Fault, all classes of Fault */
  MemoryManagement_IRQn             = -12,  /*!<   4  Memory Management, MPU mismatch, including Access Violation and No Match */
  BusFault_IRQn                     = -11,  /*!<   5  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn                   = -10,  /*!<   6  Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SVCall_IRQn                       = -5,   /*!<  11  System Service Call via SVC instruction */
  DebugMonitor_IRQn                 = -4,   /*!<  12  Debug Monitor                    */
  PendSV_IRQn                       = -2,   /*!<  14  Pendable request for system service */
  SysTick_IRQn                      = -1,   /*!<  15  System Tick Timer                */
// ----------------------------  LPC13Uxx Specific Interrupt Numbers  --------------------------------
  PIN_INT0_IRQn                     = 0,    /*!<   0  PIN_INT0                         */
  PIN_INT1_IRQn                     = 1,    /*!<   1  PIN_INT1                         */
  PIN_INT2_IRQn                     = 2,    /*!<   2  PIN_INT2                         */
  PIN_INT3_IRQn                     = 3,    /*!<   3  PIN_INT3                         */
  PIN_INT4_IRQn                     = 4,    /*!<   4  PIN_INT4                         */
  PIN_INT5_IRQn                     = 5,    /*!<   5  PIN_INT5                         */
  PIN_INT6_IRQn                     = 6,    /*!<   6  PIN_INT6                         */
  PIN_INT7_IRQn                     = 7,    /*!<   7  PIN_INT7                         */
  GINT0_IRQn                        = 8,    /*!<   8  GINT0                            */
  GINT1_IRQn                        = 9,    /*!<   9  GINT1                            */
  Reserved0_IRQn                    = 10,   /*!<  10  Reserved Interrupt               */
  Reserved1_IRQn                    = 11,   /*!<  11  Reserved Interrupt               */
  RIT_IRQn                          = 12,   /*!<  12  Repetitive Interrupt Timer       */
  Reserved2_IRQn                    = 13,   /*!<  13  Reserved Interrupt               */
  SSP1_IRQn                         = 14,   /*!<  14  SSP1                             */
  I2C_IRQn                          = 15,   /*!<  15  I2C                              */
  CT16B0_IRQn                       = 16,   /*!<  16  CT16B0                           */
  CT16B1_IRQn                       = 17,   /*!<  17  CT16B1                           */
  CT32B0_IRQn                       = 18,   /*!<  18  CT32B0                           */
  CT32B1_IRQn                       = 19,   /*!<  19  CT32B1                           */
  SSP0_IRQn                         = 20,   /*!<  20  SSP0                             */
  USART_IRQn                        = 21,   /*!<  21  USART                            */
  USB_IRQ_IRQn                      = 22,   /*!<  22  USB_IRQ                          */
  USB_FIQ_IRQn                      = 23,   /*!<  23  USB_FIQ                          */
  ADC_IRQn                          = 24,   /*!<  24  ADC                              */
  WDT_IRQn                          = 25,   /*!<  25  WDT                              */
  BOD_IRQn                          = 26,   /*!<  26  BOD                              */
  FMC_IRQn                          = 27,   /*!<  27  FMC                              */
  Reserved3_IRQn                    = 28,   /*!<  28  Reserved Interrupt               */
  Reserved4_IRQn                    = 29,   /*!<  29  Reserved Interrupt               */
  USBWAKEUP_IRQn                    = 30,   /*!<  30  USBWAKEUP                        */
  Reserved5_IRQn                    = 31,   /*!<  31  Reserved Interrupt               */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* Processor and Core Peripheral Section */ /* Configuration of the Cortex-M3 Processor and Core Peripherals */

#define __CM3_REV              0x0201       /*!< Cortex-M3 Core Revision               */
#define __MPU_PRESENT             0         /*!< MPU present or not                    */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used */
/** @} */ /* End of group Configuration_of_CMSIS */

#include <core_cm3.h>                       /*!< Cortex-M3 processor and core peripherals */
// Note: Changed for MikroE implementation.
//#include "system_LPC13Uxx.h"                /*!< LPC13Uxx System                          */
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>

/** @addtogroup Device_Peripheral_Registers
  * @{
  */


// ------------------------------------------------------------------------------------------------
// -----                                          I2C                                         -----
// ------------------------------------------------------------------------------------------------



